Wolpz/Embedded_4_Schakelklok/Emb4/Schak_RTC_Test.cydsn/Generated_Source/PSoC5/MIN_HR_DAY_MATCH_STATUSREG.h
/*******************************************************************************
* File Name: MIN_HR_DAY_MATCH_STATUSREG.h  
* Version 1.80
*
* Description:
*  This file containts Control Register function prototypes and register defines
*
* Note:
*
********************************************************************************
* Copyright 2008-2015, Cypress Semiconductor Corporation.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions, 
* disclaimers, and limitations in the end user license agreement accompanying 
* the software package with which this file was provided.
*******************************************************************************/

#if !defined(CY_CONTROL_REG_MIN_HR_DAY_MATCH_STATUSREG_H) /* CY_CONTROL_REG_MIN_HR_DAY_MATCH_STATUSREG_H */
#define CY_CONTROL_REG_MIN_HR_DAY_MATCH_STATUSREG_H

#include "cyfitter.h"

#if ((CYDEV_CHIP_FAMILY_USED == CYDEV_CHIP_FAMILY_PSOC3) || \
     (CYDEV_CHIP_FAMILY_USED == CYDEV_CHIP_FAMILY_PSOC4) || \
     (CYDEV_CHIP_FAMILY_USED == CYDEV_CHIP_FAMILY_PSOC5))
    #include "cytypes.h"
#else
    #include "syslib/cy_syslib.h"
#endif

    
/***************************************
*     Data Struct Definitions
***************************************/

/* Sleep Mode API Support */
typedef struct
{
    uint8 controlState;

} MIN_HR_DAY_MATCH_STATUSREG_BACKUP_STRUCT;


/***************************************
*         Function Prototypes 
***************************************/

void    MIN_HR_DAY_MATCH_STATUSREG_Write(uint8 control) ;
uint8   MIN_HR_DAY_MATCH_STATUSREG_Read(void) ;

void MIN_HR_DAY_MATCH_STATUSREG_SaveConfig(void) ;
void MIN_HR_DAY_MATCH_STATUSREG_RestoreConfig(void) ;
void MIN_HR_DAY_MATCH_STATUSREG_Sleep(void) ; 
void MIN_HR_DAY_MATCH_STATUSREG_Wakeup(void) ;


/***************************************
*            Registers        
***************************************/

/* Control Register */
#define MIN_HR_DAY_MATCH_STATUSREG_Control        (* (reg8 *) MIN_HR_DAY_MATCH_STATUSREG_Sync_ctrl_reg__CONTROL_REG )
#define MIN_HR_DAY_MATCH_STATUSREG_Control_PTR    (  (reg8 *) MIN_HR_DAY_MATCH_STATUSREG_Sync_ctrl_reg__CONTROL_REG )

#endif /* End CY_CONTROL_REG_MIN_HR_DAY_MATCH_STATUSREG_H */


/* [] END OF FILE */
